[
{
	"id":"5",
	"title":"#1game1week is approaching!",
	"date":"2017-10-20",
	"image":"",
	"previewImage":"",
	"previewText":"Come join us for our next 1 week game development challenge...",
	"content":"Aimed at those who struggle to finish projects, we bring you the #1game1week challenge, a challenge where you have one week to develop a fully functional game/prototype. Keep in mind that we will be scoring these games according to the following categories, some might be more important that others depending on the type of genre/topic for the week.<br><br>Tech/Engine: 10<br>Graphics: 10<br>Story: 10<br>Gameplay: 20<br><br>I know, I know, why 20 for gameplay? Well, you see... Gameplay is a unique factor in that it determines things like replayability, bugs, glitches, difficulty, and whether it keeps the player captivated in the Story, Graphics and Tech features. It gives a total score our of 50, which will be added to the Games page as a rating out of 10.<br><br>On to the good part. If you are interested , please send a tweet or facebook message to one of the links to the left or send an e-mail.<br><br>We will present you with further details on the topic and rules by Saturday 10:00AM GMT.",
		"comments":[]
	
},
{
	"id":"4",
	"title":"#1game1week - And the Winner is! Island Adventure",
	"date":"2017-10-20",
	"image":"content/islandAdventure.jpg",
	"previewImage":"content/islandAdventure.jpg",
	"previewText":"The winner of this month's #1game1week challenge, <a href='https://cwmeiring.github.io'>Island Adventure by Christo Meiring</a>",
	"content":"After quite some consideration and gameplay, we have concluded that based on the gameplay and replayability of the games, this entry by Christo Meiring is top on the list, with Stranded Horror, made by ourselves lack a bit in those departments.<br><br>So without further ado:<br><img src='content/islandAdventure001.jpg'></img><br>The game has a captivating short story to it, as you prepare for your escape from this hostile island. It features quite a few levels, difficult challenges and filled with aggrevating fun! Be sure to try it out and visit the developer's site by clicking on the links below.<br><br>Developed by Christo Meiring<br><a href='https://cwmeiring.github.io'>Developer Site</a><br><a href='https://twitter.com/MeiringCW'>Developer's Twitter</a>",
		"comments":[
		]
},
{
	"id":"3",
	"title":"Finally!",
	"date":"2017-10-20",
	"image":"",
	"previewImage":"",
	"previewText":"Finally have a basic blog system in place, now just to add a comments section for all my viewers, and happy blogging for us all...",
	"content":"Finally have a basic blog system in place, now just to add a comments section for all my viewers, and happy blogging for us all!<br>For now all comments should be sent directly to us via e-mail, and then once we receive it we will add it to the website. This is only a temporary solution as we are quite limited on what we can achieve with our current host.",
		"comments":[
		{
			"by":"<a href='https://galacticorpz.github.io'>GalactiCorpz</a>",
			"date":"2017-10-20",
			"msg":"This is an example of what a comment would be like, if you would like to let your commet link to your page, just say so in the e-mail"
		}
		]
},
{
		"id":"2",
		"title":"Hnefatafl - The Viking Board Game",
		"date":"2017-10-18",
		"image":"",
	"previewImage":"content/hnefatafl001.jpg",
	"previewText":"As we say farewell to this month's 1-Week Game Dev challenge, we kick the rest of the month of with a simple game of Hnefatafl...",
		"content":"As we say farewell to this month's 1-Week Game Dev challenge, we kick the rest of the month of with a simple game of Hnefatafl.<br/><br/><post-image><img src='content/hnefatafl001.jpg'></img></post-image>Hnefatafl became a popular game in the Viking era (around the end of the 8th Century to 1000 C.E.), while wars waged on. While there are many variations of his game, we will be using the most popular of them, Copenhagen Hnefatafl.<br/><br/><post-image><img src='content/hnefatafl002.jpg'></img></post-image>As a prototype, the game will be set on a small island, surrounded by Viking ships, you can play as either the Vikings or the Knights. It is set on a 11x11 board using strict rules according to the <a href='http://tafl.cyningstan.com/data-download/1012/copenhagen-hnefatafl-leaflet'>Copenhagen(click here to view)</a> standards.<br/><post-image><img src='content/hnefatafl003.jpg'></img></post-image><br/>At the moment, I have a working prototype going, but it is lacking a few of the rules still. I should have more information by the end of monday.",
		"comments":[
		]
	},
	{
		"id":"1",
		"title":"1-Week Challenge Has Ended!",
		"date":"2017-10-16",
		"image":"",
	"previewImage":"",
	"previewText":"And so the challenge has come to an end. Bravely our heroes created their games to combat the evil that befalls their lost isles...",
		"content":"And so the challenge has come to an end. Bravely our heroes created their games to combat the evil that befalls their lost isles. While this will not be the last of it, it sure was the most fun to start with!<br/><br/> <a href='games.html'>Click here for The Games Section</a> to view all entries!",
		"comments":[
		]
	
	},
	{
		"id":"0",
		"title":"1-Week Game Dev Challenge!",
		"date":"2017-10-9",
		"image":"",
	"previewImage":"",
	"previewText":"The goal of this challenge is to build upon our skills into speed development and aim to complete a full prototype during a period of 1 week...",
		"content":"<p>The goal of this challenge is to build upon our skills into speed development and aim to complete a full prototype during a period of 1 week.</p><p>For this challenge, here is our choices:</p><br/><p>Genre:<br/>Survival</p><br/><p>Objective<br/> Build a raft to get off the island, but beware the mystery that befalls the island.</p><br/><p>Limitations<br/> No mythical or magical references.</p><br/>",
		"comments":[
		]
	
	}]